# Data Manipulation in Python
## INFORMS 2020 Python Workshop
### Amy Newman

## Import Packages

In [235]:
import pandas as pd
import numpy as np
import json

## Loading / Saving JSON 
- JSON (Javascript Object Notation)
    - it's a standardized format to pass data around; it's easy for machines and humans to use
    - it's a form of text data written in Javascript notation and can be sent to and from a server
    - Twitter and Facebook are examples where you would retrieve data in JSON format

In [118]:
#--JSON: kind of looks like a dictionary, huh?

json = { "firstName": "Alan", "lastName": "Doe", "hobbies": ["running", "climbing", "dancing"], 
        "age": 35, "children": [ { "firstName": "Sam", "age": 6 }, { "firstName": "Jamie", "age": 8 } ] }



#--Let's make it a bit easier to see the structure--

json = {
    "firstName": "Alan",
    "lastName": "Doe",
    "hobbies": ["running", "climbing", "dancing"],
    "age": 35,
    "children": [
        {
            "firstName": "Sam",
            "age": 6
        },
        {
            "firstName": "Jamie",
            "age": 8
        }
    ]
}

In [119]:
json['firstName']

'Alan'

In [123]:
json['children'][0]['firstName']

'Sam'

In [65]:
#--Loading JSON Tweet data--
with open('data/tweets_from_nyc_taxis.json', 'r') as f:
    tweets = f.readlines()

In [60]:
len(data)

13269

In [127]:
tw_lst = []
for elem in tweets:
    tw_lst.append(elem)

In [131]:
tw_lst[0]

'{"created_at": "Tue May 01 14:18:26 +0000 2018", "id": 991320947700523009, "id_str": "991320947700523009", "text": "@NeilECollins @nyc311 Thank you for reading, Mr. Collins.  Having a TLC driver license is a privilege.  Taxi passen\\u2026 https://t.co/78C3glo1yl", "truncated": true, "entities": {"hashtags": [], "symbols": [], "user_mentions": [{"screen_name": "NeilECollins", "name": "Neil Collins", "id": 2813412205, "id_str": "2813412205", "indices": [0, 13]}, {"screen_name": "nyc311", "name": "New York City 311", "id": 37683414, "id_str": "37683414", "indices": [14, 21]}], "urls": [{"url": "https://t.co/78C3glo1yl", "expanded_url": "https://twitter.com/i/web/status/991320947700523009", "display_url": "twitter.com/i/web/status/9\\u2026", "indices": [117, 140]}]}, "source": "<a href=\\"http://twitter.com\\" rel=\\"nofollow\\">Twitter Web Client</a>", "in_reply_to_status_id": 991311021905207298, "in_reply_to_status_id_str": "991311021905207298", "in_reply_to_user_id": 2813412205, "in_reply_to_user_id_str": "2813412205", "in_reply_to_screen_name": "NeilECollins", "user": {"id": 94163495, "id_str": "94163495", "name": "NYC TLC", "screen_name": "nyctaxi", "location": "New York, NY", "description": "The TLC is the City agency that regulates app-based and traditional black & livery cars, yellow & green taxicabs,  ambulettes, commuter vans & some limousines.", "url": "https://t.co/vb35n2OpJo", "entities": {"url": {"urls": [{"url": "https://t.co/vb35n2OpJo", "expanded_url": "http://nyc.gov/tlc", "display_url": "nyc.gov/tlc", "indices": [0, 23]}]}, "description": {"urls": []}}, "protected": false, "followers_count": 13544, "friends_count": 677, "listed_count": 366, "created_at": "Wed Dec 02 20:00:22 +0000 2009", "favourites_count": 1186, "utc_offset": -14400, "time_zone": "Eastern Time (US & Canada)", "geo_enabled": true, "verified": true, "statuses_count": 4260, "lang": "en", "contributors_enabled": false, "is_translator": false, "is_translation_enabled": false, "profile_background_color": "A8C75A", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_tile": false, "profile_image_url": "http://pbs.twimg.com/profile_images/646340365897854976/1ta6i3EL_normal.jpg", "profile_image_url_https": "https://pbs.twimg.com/profile_images/646340365897854976/1ta6i3EL_normal.jpg", "profile_banner_url": "https://pbs.twimg.com/profile_banners/94163495/1412198408", "profile_link_color": "F28043", "profile_sidebar_border_color": "FFFFFF", "profile_sidebar_fill_color": "DDEEF6", "profile_text_color": "333333", "profile_use_background_image": false, "has_extended_profile": false, "default_profile": false, "default_profile_image": false, "following": null, "follow_request_sent": null, "notifications": null, "translator_type": "none"}, "geo": null, "coordinates": null, "place": null, "contributors": null, "is_quote_status": false, "retweet_count": 0, "favorite_count": 0, "favorited": false, "retweeted": false, "lang": "en"}\n'

In [125]:
tweets[0]

'{"created_at": "Tue May 01 14:18:26 +0000 2018", "id": 991320947700523009, "id_str": "991320947700523009", "text": "@NeilECollins @nyc311 Thank you for reading, Mr. Collins.  Having a TLC driver license is a privilege.  Taxi passen\\u2026 https://t.co/78C3glo1yl", "truncated": true, "entities": {"hashtags": [], "symbols": [], "user_mentions": [{"screen_name": "NeilECollins", "name": "Neil Collins", "id": 2813412205, "id_str": "2813412205", "indices": [0, 13]}, {"screen_name": "nyc311", "name": "New York City 311", "id": 37683414, "id_str": "37683414", "indices": [14, 21]}], "urls": [{"url": "https://t.co/78C3glo1yl", "expanded_url": "https://twitter.com/i/web/status/991320947700523009", "display_url": "twitter.com/i/web/status/9\\u2026", "indices": [117, 140]}]}, "source": "<a href=\\"http://twitter.com\\" rel=\\"nofollow\\">Twitter Web Client</a>", "in_reply_to_status_id": 991311021905207298, "in_reply_to_status_id_str": "991311021905207298", "in_reply_to_user_id": 2813412205, "in_reply_to_user_id_str": "2813412205", "in_reply_to_screen_name": "NeilECollins", "user": {"id": 94163495, "id_str": "94163495", "name": "NYC TLC", "screen_name": "nyctaxi", "location": "New York, NY", "description": "The TLC is the City agency that regulates app-based and traditional black & livery cars, yellow & green taxicabs,  ambulettes, commuter vans & some limousines.", "url": "https://t.co/vb35n2OpJo", "entities": {"url": {"urls": [{"url": "https://t.co/vb35n2OpJo", "expanded_url": "http://nyc.gov/tlc", "display_url": "nyc.gov/tlc", "indices": [0, 23]}]}, "description": {"urls": []}}, "protected": false, "followers_count": 13544, "friends_count": 677, "listed_count": 366, "created_at": "Wed Dec 02 20:00:22 +0000 2009", "favourites_count": 1186, "utc_offset": -14400, "time_zone": "Eastern Time (US & Canada)", "geo_enabled": true, "verified": true, "statuses_count": 4260, "lang": "en", "contributors_enabled": false, "is_translator": false, "is_translation_enabled": false, "profile_background_color": "A8C75A", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_tile": false, "profile_image_url": "http://pbs.twimg.com/profile_images/646340365897854976/1ta6i3EL_normal.jpg", "profile_image_url_https": "https://pbs.twimg.com/profile_images/646340365897854976/1ta6i3EL_normal.jpg", "profile_banner_url": "https://pbs.twimg.com/profile_banners/94163495/1412198408", "profile_link_color": "F28043", "profile_sidebar_border_color": "FFFFFF", "profile_sidebar_fill_color": "DDEEF6", "profile_text_color": "333333", "profile_use_background_image": false, "has_extended_profile": false, "default_profile": false, "default_profile_image": false, "following": null, "follow_request_sent": null, "notifications": null, "translator_type": "none"}, "geo": null, "coordinates": null, "place": null, "contributors": null, "is_quote_status": false, "retweet_count": 0, "favorite_count": 0, "favorited": false, "retweeted": false, "lang": "en"}\n'

In [71]:
#--Pretty print the first tweet to get a sense of the data--
parsed = json.loads(tweets[0])
print(json.dumps(parsed, indent=4, sort_keys=True))

{
    "contributors": null,
    "coordinates": null,
    "created_at": "Tue May 01 14:18:26 +0000 2018",
    "entities": {
        "hashtags": [],
        "symbols": [],
        "urls": [
            {
                "display_url": "twitter.com/i/web/status/9\u2026",
                "expanded_url": "https://twitter.com/i/web/status/991320947700523009",
                "indices": [
                    117,
                    140
                ],
                "url": "https://t.co/78C3glo1yl"
            }
        ],
        "user_mentions": [
            {
                "id": 2813412205,
                "id_str": "2813412205",
                "indices": [
                    0,
                    13
                ],
                "name": "Neil Collins",
                "screen_name": "NeilECollins"
            },
            {
                "id": 37683414,
                "id_str": "37683414",
                "indices": [
                    14,
                    21
                ],
                "name": "New York City 311",
                "screen_name": "nyc311"
            }
        ]
    },
    "favorite_count": 0,
    "favorited": false,
    "geo": null,
    "id": 991320947700523009,
    "id_str": "991320947700523009",
    "in_reply_to_screen_name": "NeilECollins",
    "in_reply_to_status_id": 991311021905207298,
    "in_reply_to_status_id_str": "991311021905207298",
    "in_reply_to_user_id": 2813412205,
    "in_reply_to_user_id_str": "2813412205",
    "is_quote_status": false,
    "lang": "en",
    "place": null,
    "retweet_count": 0,
    "retweeted": false,
    "source": "<a href=\"http://twitter.com\" rel=\"nofollow\">Twitter Web Client</a>",
    "text": "@NeilECollins @nyc311 Thank you for reading, Mr. Collins.  Having a TLC driver license is a privilege.  Taxi passen\u2026 https://t.co/78C3glo1yl",
    "truncated": true,
    "user": {
        "contributors_enabled": false,
        "created_at": "Wed Dec 02 20:00:22 +0000 2009",
        "default_profile": false,
        "default_profile_image": false,
        "description": "The TLC is the City agency that regulates app-based and traditional black & livery cars, yellow & green taxicabs,  ambulettes, commuter vans & some limousines.",
        "entities": {
            "description": {
                "urls": []
            },
            "url": {
                "urls": [
                    {
                        "display_url": "nyc.gov/tlc",
                        "expanded_url": "http://nyc.gov/tlc",
                        "indices": [
                            0,
                            23
                        ],
                        "url": "https://t.co/vb35n2OpJo"
                    }
                ]
            }
        },
        "favourites_count": 1186,
        "follow_request_sent": null,
        "followers_count": 13544,
        "following": null,
        "friends_count": 677,
        "geo_enabled": true,
        "has_extended_profile": false,
        "id": 94163495,
        "id_str": "94163495",
        "is_translation_enabled": false,
        "is_translator": false,
        "lang": "en",
        "listed_count": 366,
        "location": "New York, NY",
        "name": "NYC TLC",
        "notifications": null,
        "profile_background_color": "A8C75A",
        "profile_background_image_url": "http://abs.twimg.com/images/themes/theme1/bg.png",
        "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme1/bg.png",
        "profile_background_tile": false,
        "profile_banner_url": "https://pbs.twimg.com/profile_banners/94163495/1412198408",
        "profile_image_url": "http://pbs.twimg.com/profile_images/646340365897854976/1ta6i3EL_normal.jpg",
        "profile_image_url_https": "https://pbs.twimg.com/profile_images/646340365897854976/1ta6i3EL_normal.jpg",
        "profile_link_color": "F28043",
        "profile_sidebar_border_color": "FFFFFF",
        "profile_sidebar_fill_color": "DDEEF6",
        "profile_text_color": "333333",
        "profile_use_background_image": false,
        "protected": false,
        "screen_name": "nyctaxi",
        "statuses_count": 4260,
        "time_zone": "Eastern Time (US & Canada)",
        "translator_type": "none",
        "url": "https://t.co/vb35n2OpJo",
        "utc_offset": -14400,
        "verified": true
    }
}

In [74]:
your_json = '["foo", {"bar":["baz", null, 1.0, 2]}]'
parsed = json.loads(your_json)
print(json.dumps(parsed, indent=4, sort_keys=True))

[
    "foo",
    {
        "bar": [
            "baz",
            null,
            1.0,
            2
        ]
    }
]

In [98]:
#--Loading and saving the JSON data--
with open('data/tweets_from_nyc_taxis.json', 'r', encoding='utf-8') as f:
    data = f.read()

In [99]:
type(data)

str

In [100]:
#--Loading and saving the JSON data--
with open('data/tweets_from_nyc_taxis.json', 'r') as f:
    data = f.readlines()

In [102]:
type(data)

list

In [117]:
#--Loading JSON Twitter data--
taxi_tweets = 'data/tweets_from_nyc_taxis.json'

with open(taxi_tweets) as f:
    data = json.loads(f.read())

JSONDecodeError: Extra data: line 2 column 1 (char 3082)

In [109]:
#--Saving JSON data to a file--
file_name = "data/data_file.json" 

with open(file_name, "w") as write_file:
    json.dump(data, write_file)

## Loading / Saving pandas

In [303]:
#--Loading a .csv file to pandas--
zones = pd.read_csv('data/taxi_zones_simple.csv')

In [304]:
#--taking a look at the first 5 rows to see if it loaded ok--
zones.head()

   locationid                     zone        borough
0           1           Newark Airport            EWR
1           2              Jamaica Bay         Queens
2           3  Allerton/Pelham Gardens          Bronx
3           4            Alphabet City      Manhattan
4           5            Arden Heights  Staten Island

In [222]:
trips = pd.read_csv('data/clean_taxi_sample.tsv.gz', sep='\t')

In [223]:
trips.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2018-01-01 00:00:00,2018-01-01 00:00:00,1,9.14,1,N,229,17,2,27.0,0.0,0.5,0.0,0.0,0.3,27.8
1,2,2018-01-01 00:00:02,2018-01-01 00:08:48,1,1.36,1,N,68,249,2,7.5,0.5,0.5,0.0,0.0,0.3,8.8
2,1,2018-01-01 00:00:03,2018-01-01 00:21:06,1,6.10,1,N,255,236,2,20.5,0.5,0.5,0.0,0.0,0.3,21.8
3,2,2018-01-01 00:00:03,2018-01-01 00:03:52,3,0.99,1,N,236,43,2,5.5,0.5,0.5,0.0,0.0,0.3,6.8
4,1,2018-01-01 00:00:04,2018-01-01 00:13:24,1,3.60,1,N,37,157,2,13.5,0.5,0.5,0.0,0.0,0.3,14.8

In [170]:
counts = pd.read_csv('data/daily_taxi_counts_2018.tsv', sep='\t')

In [172]:
counts.head()

         date  n_trips
0  2018-03-01   332802
1  2018-03-02   326944
2  2018-03-03   316823
3  2018-03-04   286326
4  2018-03-05   290631

## Viewing / Selecting pandas
- .head( )
    - allows you to view the first 5 rows in your data, including column names
    - it's helpful to do this anytime you create a dataframe
- .shape
    - allows you to see the number of rows and columns within your dataframe
    - it's helpful to do this anytime you create a dataframe
- .loc[ ]
    - gets rows (or columns) with specific labels from the index
- .iloc[ ]
    - gets rows (or columns) at specific positions in the index (so it only takes integers)
- df [ ['column_name'] ]
    - returns the named column of data

In [157]:
#--Is this the shape you expected for your dataframe?--
trips.shape

(20000, 17)

In [136]:
#--Viewing your data--
trips.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2018-01-01 00:00:00,2018-01-01 00:00:00,1,9.14,1,N,229,17,2,27.0,0.0,0.5,0.0,0.0,0.3,27.8
1,2,2018-01-01 00:00:02,2018-01-01 00:08:48,1,1.36,1,N,68,249,2,7.5,0.5,0.5,0.0,0.0,0.3,8.8
2,1,2018-01-01 00:00:03,2018-01-01 00:21:06,1,6.10,1,N,255,236,2,20.5,0.5,0.5,0.0,0.0,0.3,21.8
3,2,2018-01-01 00:00:03,2018-01-01 00:03:52,3,0.99,1,N,236,43,2,5.5,0.5,0.5,0.0,0.0,0.3,6.8
4,1,2018-01-01 00:00:04,2018-01-01 00:13:24,1,3.60,1,N,37,157,2,13.5,0.5,0.5,0.0,0.0,0.3,14.8

In [137]:
#--Seeing more than 5 rows of your data--
trips.head(7)

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2018-01-01 00:00:00,2018-01-01 00:00:00,1,9.14,1,N,229,17,2,27.0,0.0,0.5,0.00,0.0,0.3,27.80
1,2,2018-01-01 00:00:02,2018-01-01 00:08:48,1,1.36,1,N,68,249,2,7.5,0.5,0.5,0.00,0.0,0.3,8.80
2,1,2018-01-01 00:00:03,2018-01-01 00:21:06,1,6.10,1,N,255,236,2,20.5,0.5,0.5,0.00,0.0,0.3,21.80
3,2,2018-01-01 00:00:03,2018-01-01 00:03:52,3,0.99,1,N,236,43,2,5.5,0.5,0.5,0.00,0.0,0.3,6.80
4,1,2018-01-01 00:00:04,2018-01-01 00:13:24,1,3.60,1,N,37,157,2,13.5,0.5,0.5,0.00,0.0,0.3,14.80
5,2,2018-01-01 00:00:04,2018-01-01 00:08:13,1,1.59,1,N,141,161,2,8.0,0.5,0.5,0.00,0.0,0.3,9.30
6,1,2018-01-01 00:00:06,2018-01-01 00:24:34,1,6.90,1,N,162,49,1,23.5,0.5,0.5,4.95,0.0,0.3,29.75

In [139]:
#--Choosing rows based on a condition in a column--
id2 = trips.loc[trips['VendorID'] == 2]
id2.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2018-01-01 00:00:00,2018-01-01 00:00:00,1,9.14,1,N,229,17,2,27.0,0.0,0.5,0.00,0.0,0.3,27.80
1,2,2018-01-01 00:00:02,2018-01-01 00:08:48,1,1.36,1,N,68,249,2,7.5,0.5,0.5,0.00,0.0,0.3,8.80
3,2,2018-01-01 00:00:03,2018-01-01 00:03:52,3,0.99,1,N,236,43,2,5.5,0.5,0.5,0.00,0.0,0.3,6.80
5,2,2018-01-01 00:00:04,2018-01-01 00:08:13,1,1.59,1,N,141,161,2,8.0,0.5,0.5,0.00,0.0,0.3,9.30
12,2,2018-01-01 00:00:15,2018-01-01 00:14:17,1,2.06,1,N,90,137,1,10.5,0.5,0.5,2.36,0.0,0.3,14.16

In [142]:
#--Choosing rows by Combining multiple conditions--
trips.loc[(trips['trip_distance'] >= 5) & (trips['trip_distance'] <= 10)] #--want all trips beteween 5 and 10 miles

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2018-01-01 00:00:00,2018-01-01 00:00:00,1,9.14,1,N,229,17,2,27.0,0.0,0.5,0.00,0.0,0.3,27.80
2,1,2018-01-01 00:00:03,2018-01-01 00:21:06,1,6.10,1,N,255,236,2,20.5,0.5,0.5,0.00,0.0,0.3,21.80
6,1,2018-01-01 00:00:06,2018-01-01 00:24:34,1,6.90,1,N,162,49,1,23.5,0.5,0.5,4.95,0.0,0.3,29.75
22,1,2018-01-01 00:00:25,2018-01-01 00:20:37,1,7.40,1,N,237,116,2,24.0,0.5,0.5,0.00,0.0,0.3,25.30
40,2,2018-01-01 00:00:39,2018-01-01 00:28:19,1,5.33,1,N,238,142,2,22.0,0.5,0.5,0.00,0.0,0.3,23.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19977,1,2018-01-01 01:10:49,2018-01-01 01:41:24,2,5.30,1,N,148,143,1,23.0,0.5,0.5,4.85,0.0,0.3,29.15
19987,2,2018-01-01 01:10:51,2018-01-01 01:24:32,1,5.40,1,N,231,233,1,17.0,0.5,0.5,0.00,0.0,0.3,18.30
19991,1,2018-01-01 01:10:52,2018-01-01 01:40:14,1,9.40,1,N,229,181,1,30.0,0.5,0.5,9.35,0.0,0.3,40.65
19998,1,2018-01-01 01:10:54,2018-01-01 01:35:00,1,8.00,1,N,141,255,1,26.5,0.5,0.5,5.55,0.0,0.3,33.35
19999,1,2018-01-01 01:10:54,2018-01-01 01:38:01,2,5.40,1,N,249,236,2,21.0,0.5,0.5,0.00,0.0,0.3,22.30

In [144]:
#--Choosing rows by excluding a condition--
trips.loc[trips['passenger_count'] != 1]

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
3,2,2018-01-01 00:00:03,2018-01-01 00:03:52,3,0.99,1,N,236,43,2,5.5,0.5,0.5,0.0,0.0,0.3,6.8
11,1,2018-01-01 00:00:15,2018-01-01 00:08:21,2,1.20,1,N,232,107,2,7.0,0.5,0.5,0.0,0.0,0.3,8.3
15,1,2018-01-01 00:00:18,2018-01-01 00:29:50,4,13.20,1,N,138,72,2,39.0,0.5,0.5,0.0,0.0,0.3,40.3
17,1,2018-01-01 00:00:20,2018-01-01 00:06:23,2,1.10,1,N,164,162,3,6.5,0.5,0.5,0.0,0.0,0.3,7.8
28,1,2018-01-01 00:00:27,2018-01-01 00:04:11,4,0.30,1,N,233,161,2,4.5,0.5,0.5,0.0,0.0,0.3,5.8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19988,2,2018-01-01 01:10:51,2018-01-01 01:19:56,2,1.02,1,N,237,163,1,7.5,0.5,0.5,3.3,0.0,0.3,12.1
19992,1,2018-01-01 01:10:53,2018-01-01 01:29:19,3,3.70,1,N,50,231,2,15.0,0.5,0.5,0.0,0.0,0.3,16.3
19994,2,2018-01-01 01:10:53,2018-01-01 01:18:56,2,1.20,1,N,166,238,1,7.5,0.5,0.5,2.2,0.0,0.3,11.0
19996,1,2018-01-01 01:10:53,2018-01-01 01:34:04,4,1.90,1,N,246,249,1,15.0,0.5,0.5,0.0,0.0,0.3,16.3
19999,1,2018-01-01 01:10:54,2018-01-01 01:38:01,2,5.40,1,N,249,236,2,21.0,0.5,0.5,0.0,0.0,0.3,22.3

In [166]:
#--Choosing data by column--
trips.iloc[:,:4] #--This chooses all of the rows in the dataframe from column 0 to 3

       VendorID tpep_pickup_datetime tpep_dropoff_datetime  passenger_count
0             2  2018-01-01 00:00:00   2018-01-01 00:00:00                1
1             2  2018-01-01 00:00:02   2018-01-01 00:08:48                1
2             1  2018-01-01 00:00:03   2018-01-01 00:21:06                1
3             2  2018-01-01 00:00:03   2018-01-01 00:03:52                3
4             1  2018-01-01 00:00:04   2018-01-01 00:13:24                1
...         ...                  ...                   ...              ...
19995         2  2018-01-01 01:10:53   2018-01-01 01:32:37                1
19996         1  2018-01-01 01:10:53   2018-01-01 01:34:04                4
19997         2  2018-01-01 01:10:53   2018-01-01 01:24:39                1
19998         1  2018-01-01 01:10:54   2018-01-01 01:35:00                1
19999         1  2018-01-01 01:10:54   2018-01-01 01:38:01                2

[20000 rows x 4 columns]

In [ ]:
#--Selecting certain columns from the entire dataframe by name, making a new dataframe--
trip_sub = trips[['tpep_pickup_datetime', 'tpep_dropoff_datetime', 'total_amount']]

## Checking / Changing Column Types
- Especially pd.to_datetime() for the date data
- I (Jeff) used this in a talk a while ago and will use it on Saturday morning again to talk about optimization. I dont think we really need to go into all these options in this lesson. It might be good to flag that there are many ways to do the same thing, such as making a column an integer, though, and that in most cases theyre all equally good choices. (look at Lesson_content_outline in Google Docs for image)

In [ ]:
#--Converting column to int or float--

In [215]:
trips.dtypes

VendorID                   int64
tpep_pickup_datetime      object
tpep_dropoff_datetime     object
passenger_count            int64
trip_distance            float64
RatecodeID                 int64
store_and_fwd_flag        object
PULocationID               int64
DOLocationID               int64
payment_type               int64
fare_amount              float64
extra                    float64
mta_tax                  float64
tip_amount               float64
tolls_amount             float64
improvement_surcharge    float64
total_amount             float64
fair_tip_amt             float64
tip_percent              float64
dtype: object

In [217]:
trips.store_and_fwd_flag.unique()

array(['N', 'Y'], dtype=object)

In [255]:
zones.dtypes

locationid     int64
zone          object
borough       object
dtype: object

In [256]:
zones.head()

   locationid                     zone        borough
0           1           Newark Airport            EWR
1           2              Jamaica Bay         Queens
2           3  Allerton/Pelham Gardens          Bronx
3           4            Alphabet City      Manhattan
4           5            Arden Heights  Staten Island

In [177]:
counts = pd.read_csv('data/daily_taxi_counts_2018.tsv', sep='\t')
counts.head()

         date  n_trips
0  2018-03-01   332802
1  2018-03-02   326944
2  2018-03-03   316823
3  2018-03-04   286326
4  2018-03-05   290631

In [176]:
counts.dtypes

date       object
n_trips     int64
dtype: object

In [174]:
#--Convert date column to datetime to make data more accessible--
counts['date'] = pd.to_datetime(counts.date)
counts.dtypes

date       datetime64[ns]
n_trips             int64
dtype: object

In [179]:
#--extract day only--

AttributeError: 'Series' object has no attribute 'days'

## Summarizing

In [153]:
#-- df.describe() returns statistical details like percentile, mean, std etc. of a data frame or a series of numeric values--
trips.describe()

,VendorID,passenger_count,trip_distance,RatecodeID,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
count,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000,20000.00000,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000
mean,1.565000,1.735400,2.749124,1.031000,158.827750,159.074550,1.409450,12.58336,0.493790,0.496975,1.621925,0.105998,0.299460,15.611760
std,0.495769,1.277289,2.961542,0.326411,71.059017,74.392553,0.518859,9.87974,0.060857,0.043052,2.437912,0.895354,0.017226,11.354625
min,1.000000,0.000000,0.000000,1.000000,3.000000,1.000000,1.000000,-52.00000,-0.500000,-0.500000,0.000000,0.000000,-0.300000,-52.800000
25%,1.000000,1.000000,1.000000,1.000000,107.000000,95.000000,1.000000,6.50000,0.500000,0.500000,0.000000,0.000000,0.300000,8.760000
50%,2.000000,1.000000,1.800000,1.000000,158.000000,161.000000,1.000000,10.00000,0.500000,0.500000,1.060000,0.000000,0.300000,12.360000
75%,2.000000,2.000000,3.400000,1.000000,234.000000,234.000000,2.000000,15.50000,0.500000,0.500000,2.450000,0.000000,0.300000,18.960000
max,2.000000,6.000000,37.820000,6.000000,265.000000,265.000000,4.000000,250.00000,1.000000,0.500000,80.000000,26.020000,0.300000,250.800000

## Replacing

In [187]:
zones.head()

   locationid                     zone        borough
0           1           Newark Airport            EWR
1           2              Jamaica Bay         Queens
2           3  Allerton/Pelham Gardens          Bronx
3           4            Alphabet City      Manhattan
4           5            Arden Heights  Staten Island

In [259]:
# this will replace instanceas of "Newark Airport" with "Newark Liberty International Airport"
zones = zones.replace(to_replace =["Newark Airport"],  
                            value = "Newark Liberty International Airport")

In [261]:
zones.head()

   locationid                                  zone        borough
0           1  Newark Liberty International Airport            EWR
1           2                           Jamaica Bay         Queens
2           3               Allerton/Pelham Gardens          Bronx
3           4                         Alphabet City      Manhattan
4           5                         Arden Heights  Staten Island

In [ ]:
#--Replace nonetype with.....

In [ ]:
# # Making data frame from the csv file 
# df = pd.read_csv("nba.csv") 
  
# # will replace  Nan value in dataframe with value 0
# df.replace(to_replace = np.nan, value =0)

## Make New Columns (vector ops)

In [224]:
trips.shape

(20000, 17)

In [229]:
#--tip percentage per trip--
trips['tip_percent'] = trips['tip_amount']/trips['total_amount']

In [227]:
trips.shape

(20000, 18)

In [230]:
trips.head(10)

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,tip_percent
0,2,2018-01-01 00:00:00,2018-01-01 00:00:00,1,9.14,1,N,229,17,2,27.0,0.0,0.5,0.00,0.0,0.3,27.80,0.000000
1,2,2018-01-01 00:00:02,2018-01-01 00:08:48,1,1.36,1,N,68,249,2,7.5,0.5,0.5,0.00,0.0,0.3,8.80,0.000000
2,1,2018-01-01 00:00:03,2018-01-01 00:21:06,1,6.10,1,N,255,236,2,20.5,0.5,0.5,0.00,0.0,0.3,21.80,0.000000
3,2,2018-01-01 00:00:03,2018-01-01 00:03:52,3,0.99,1,N,236,43,2,5.5,0.5,0.5,0.00,0.0,0.3,6.80,0.000000
4,1,2018-01-01 00:00:04,2018-01-01 00:13:24,1,3.60,1,N,37,157,2,13.5,0.5,0.5,0.00,0.0,0.3,14.80,0.000000
5,2,2018-01-01 00:00:04,2018-01-01 00:08:13,1,1.59,1,N,141,161,2,8.0,0.5,0.5,0.00,0.0,0.3,9.30,0.000000
6,1,2018-01-01 00:00:06,2018-01-01 00:24:34,1,6.90,1,N,162,49,1,23.5,0.5,0.5,4.95,0.0,0.3,29.75,0.166387
7,1,2018-01-01 00:00:11,2018-01-01 00:06:05,1,1.70,1,N,238,143,1,7.0,0.5,0.5,1.65,0.0,0.3,9.95,0.165829
8,1,2018-01-01 00:00:13,2018-01-01 00:07:03,1,0.90,1,N,144,249,1,6.0,0.5,0.5,1.80,0.0,0.3,9.10,0.197802
9,1,2018-01-01 00:00:14,2018-01-01 00:11:38,1,4.00,1,N,170,232,2,14.0,0.5,0.5,0.00,0.0,0.3,15.30,0.000000

In [ ]:
#--TODO: Add another example, then add an exercise here--

## Applying Functions to Columns
- Applying a function directly to a column
    - Example: The tip_percent column we created above looks a bit messy, lets fix it with the round() function 
- Using .apply()
    - Allows you to apply a function along an axis in a dataframe

In [231]:
#-- Rounding values: this will change all of the values in the trips['tip_percent'] column --
trips['tip_percent'] = round(trips['tip_percent'], 4) #--change the value from a 4 to a 2 and see what happens--

In [233]:
trips.head(10)

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,tip_percent
0,2,2018-01-01 00:00:00,2018-01-01 00:00:00,1,9.14,1,N,229,17,2,27.0,0.0,0.5,0.00,0.0,0.3,27.80,0.0000
1,2,2018-01-01 00:00:02,2018-01-01 00:08:48,1,1.36,1,N,68,249,2,7.5,0.5,0.5,0.00,0.0,0.3,8.80,0.0000
2,1,2018-01-01 00:00:03,2018-01-01 00:21:06,1,6.10,1,N,255,236,2,20.5,0.5,0.5,0.00,0.0,0.3,21.80,0.0000
3,2,2018-01-01 00:00:03,2018-01-01 00:03:52,3,0.99,1,N,236,43,2,5.5,0.5,0.5,0.00,0.0,0.3,6.80,0.0000
4,1,2018-01-01 00:00:04,2018-01-01 00:13:24,1,3.60,1,N,37,157,2,13.5,0.5,0.5,0.00,0.0,0.3,14.80,0.0000
5,2,2018-01-01 00:00:04,2018-01-01 00:08:13,1,1.59,1,N,141,161,2,8.0,0.5,0.5,0.00,0.0,0.3,9.30,0.0000
6,1,2018-01-01 00:00:06,2018-01-01 00:24:34,1,6.90,1,N,162,49,1,23.5,0.5,0.5,4.95,0.0,0.3,29.75,0.1664
7,1,2018-01-01 00:00:11,2018-01-01 00:06:05,1,1.70,1,N,238,143,1,7.0,0.5,0.5,1.65,0.0,0.3,9.95,0.1658
8,1,2018-01-01 00:00:13,2018-01-01 00:07:03,1,0.90,1,N,144,249,1,6.0,0.5,0.5,1.80,0.0,0.3,9.10,0.1978
9,1,2018-01-01 00:00:14,2018-01-01 00:11:38,1,4.00,1,N,170,232,2,14.0,0.5,0.5,0.00,0.0,0.3,15.30,0.0000

In [239]:
#--Using .apply() to find the sum of all taxi ride totals in this dataset--
trips[['total_amount']].apply(np.sum, axis=0)

total_amount    312235.2
dtype: float64

In [249]:
zones.head()

   locationid                     zone        borough
0           1           Newark Airport            EWR
1           2              Jamaica Bay         Queens
2           3  Allerton/Pelham Gardens          Bronx
3           4            Alphabet City      Manhattan
4           5            Arden Heights  Staten Island

In [250]:
#--Applying .lower() to columns in the zones df--
zones['zone'] = zones['zone'].str.lower()

In [251]:
zones.head()

   locationid                     zone        borough
0           1           newark airport            EWR
1           2              jamaica bay         Queens
2           3  allerton/pelham gardens          Bronx
3           4            alphabet city      Manhattan
4           5            arden heights  Staten Island

## Renaming Things
- The rename() method can be used to rename any index, column, or row

In [316]:
zones.columns

Index(['LOCATIONID', 'ZONE', 'BOROUGH'], dtype='object')

In [309]:
#--Renaming 1 column at a time--
zones.rename(columns={'zone': 'ZONE'}, inplace=True)

In [310]:
zones.columns

Index(['LOCATIONID', 'ZONE', 'BOROUGH'], dtype='object')

In [305]:
#--Renaming multiple columns at a time: 3 different approaches--

# zones.rename(columns={'locationid': 'LOCATIONID', 'borough': 'BOROUGH'}, inplace=True) #--Where inplace=True causes the name change to stay with the dataframe zones
# zones.rename({'locationid': 'LOCATIONID', 'borough': 'BOROUGH'},  axis='columns')
zones.rename({'locationid': 'LOCATIONID','borough': 'BOROUGH'}, inplace=True, axis= 1)

In [311]:
zones.columns

Index(['LOCATIONID', 'ZONE', 'BOROUGH'], dtype='object')

In [315]:
#--Renaming rows and index--

## groupby and unstack

## Resample and timedelta

In [321]:
#--timedelta
#-- https://docs.python.org/3/library/datetime.html
from datetime import timedelta

In [319]:
hours = pd.read_csv('data/hourly_taxi_counts_2018.tsv', sep='\t')

In [320]:
hours.head()

                  date  n_trips
0  2018-03-01 00:00:00     7568
1  2018-03-01 01:00:00     4330
2  2018-03-01 02:00:00     2753
3  2018-03-01 03:00:00     1844
4  2018-03-01 04:00:00     1921